burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_adc.h
/*!
    \file    gd32w51x_f5hc_adc.h
    \brief   definitions for the ADC
    
    \version 2026-04-15, V2.0.0, firmware for gd32w51x_f5hc
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/


#ifndef gd32w51x_f5hc_ADC_H
#define gd32w51x_f5hc_ADC_H

#include "gd32w51x_f5hc.h"

/* ADC definitions */
#define ADC                             ADC_BASE

/* registers definitions */
#define ADC_STAT                        REG32(ADC + 0x00000000U)             /*!< ADC status register */
#define ADC_CTL0                        REG32(ADC + 0x00000004U)             /*!< ADC control register 0 */
#define ADC_CTL1                        REG32(ADC + 0x00000008U)             /*!< ADC control register 1 */
#define ADC_SAMPT0                      REG32(ADC + 0x0000000CU)             /*!< ADC sampling time register 0 */
#define ADC_SAMPT1                      REG32(ADC + 0x00000010U)             /*!< ADC sampling time register 1 */
#define ADC_IOFF0                       REG32(ADC + 0x00000014U)             /*!< ADC inserted channel data offset register 0 */
#define ADC_IOFF1                       REG32(ADC + 0x00000018U)             /*!< ADC inserted channel data offset register 1 */
#define ADC_IOFF2                       REG32(ADC + 0x0000001CU)             /*!< ADC inserted channel data offset register 2 */
#define ADC_IOFF3                       REG32(ADC + 0x00000020U)             /*!< ADC inserted channel data offset register 3 */
#define ADC_WD0HT                       REG32(ADC + 0x00000024U)             /*!< ADC watchdog 0 high threshold register */
#define ADC_WD0LT                       REG32(ADC + 0x00000028U)             /*!< ADC watchdog 0 low threshold register */
#define ADC_RSQ0                        REG32(ADC + 0x0000002CU)             /*!< ADC routine sequence register 0 */
#define ADC_RSQ1                        REG32(ADC + 0x00000030U)             /*!< ADC routine sequence register 1 */
#define ADC_RSQ2                        REG32(ADC + 0x00000034U)             /*!< ADC routine sequence register 2 */
#define ADC_ISQ                         REG32(ADC + 0x00000038U)             /*!< ADC inserted sequence register */
#if defined(GD32F5HC)
#define ADC_LDATA0                      REG32(ADC + 0x0000003CU)             /*!< ADC latch data register 0 */
#define ADC_LDATA1                      REG32(ADC + 0x00000040U)             /*!< ADC latch data register 1 */
#define ADC_LDATA2                      REG32(ADC + 0x00000044U)             /*!< ADC latch data register 2 */
#define ADC_LDATA3                      REG32(ADC + 0x00000048U)             /*!< ADC latch data register 3 */
#endif /* defined(GD32F5HC) */
#define ADC_RDATA                       REG32(ADC + 0x0000004CU)             /*!< ADC routine data register */
#if defined(GD32F5HC)
#define ADC_IDATA                       REG32(ADC + 0x00000050U)             /*!< ADC inserted data register */
#else
#define ADC_IDATA0                      REG32(ADC + 0x0000003CU)             /*!< ADC inserted data register 0 */
#define ADC_IDATA1                      REG32(ADC + 0x00000040U)             /*!< ADC inserted data register 1 */
#define ADC_IDATA2                      REG32(ADC + 0x00000044U)             /*!< ADC inserted data register 2 */
#define ADC_IDATA3                      REG32(ADC + 0x00000048U)             /*!< ADC inserted data register 3 */
#endif /* defined(GD32F5HC) */
#if defined(GD32F5HC)
#define ADC_LDCTL                       REG32(ADC + 0x00000054U)             /*!< ADC latch data control register */
#endif /* defined(GD32F5HC) */
#define ADC_OVSAMPCTL                   REG32(ADC + 0x00000080U)             /*!< ADC oversampling control register */
#define ADC_CCTL                        REG32(ADC + 0x00000304U)             /*!< ADC commom control register */

/* bits definitions */
/* ADC_STAT */
#define ADC_STAT_WD0E                   BIT(0)                              /*!< analog watchdog 0 event flag */
#if defined(GD32F5HC)
#define ADC_STAT_EORC                   BIT(1)                              /*!< routine channel end of conversion */
#else
#define ADC_STAT_EOC                    BIT(1)                              /*!< end of sequence conversion */
#endif /* defined(GD32F5HC) */
#define ADC_STAT_EOIC                   BIT(2)                              /*!< inserted channel end of sequence conversion */
#define ADC_STAT_STIC                   BIT(3)                              /*!< inserted channel start flag */
#define ADC_STAT_STRC                   BIT(4)                              /*!< routine channel start flag */
#define ADC_STAT_ROVF                   BIT(5)                              /*!< routine data register overflow */
#if defined(GD32F5HC)
#define ADC_STAT_IOVF                   BIT(6)                              /*!< inserted data register overflow flag */
#endif

/* ADC_CTL0 */
#define ADC_CTL0_WD0CHSEL               BITS(0, 4)                          /*!< analog watchdog 0 channel select bits */
#if defined(GD32F5HC)
#define ADC_CTL0_EORCIE                 BIT(5)                              /*!< interrupt enable for EORC */
#else
#define ADC_CTL0_EOCIE                  BIT(5)                              /*!< interrupt enable for EOC */
#endif /* defined(GD32F5HC) */
#define ADC_CTL0_WD0EIE                 BIT(6)                              /*!< analog watchdog 0 interrupt enable */
#define ADC_CTL0_EOICIE                 BIT(7)                              /*!< interrupt enable for inserted channels */
#define ADC_CTL0_SM                     BIT(8)                              /*!< scan mode */
#define ADC_CTL0_WD0SC                  BIT(9)                              /*!< when in scan mode, analog watchdog 0 is effective on a single channel */
#define ADC_CTL0_ICA                    BIT(10)                             /*!< automatic inserted sequence conversion */
#define ADC_CTL0_DISRC                  BIT(11)                             /*!< discontinuous mode on routine channels */
#define ADC_CTL0_DISIC                  BIT(12)                             /*!< discontinuous mode on inserted channels */
#define ADC_CTL0_DISNUM                 BITS(13, 15)                        /*!< discontinuous mode channel count */
#define ADC_CTL0_IWD0EN                 BIT(22)                             /*!< analog watchdog 0 enable on inserted channels */
#define ADC_CTL0_RWD0EN                 BIT(23)                             /*!< analog watchdog 0 enable on routine channels */
#define ADC_CTL0_ROVFIE                 BIT(26)                             /*!< interrupt enable for routine data register overflow */
#if defined(GD32F5HC)
#define ADC_CTL0_IOVFIE                 BIT(27)                             /*!< interrupt enable for inserted data register overflow */
#endif /* defined(GD32F5HC) */

/* ADC_CTL1 */
#define ADC_CTL1_ADCON                  BIT(0)                              /*!< ADC converter on */
#define ADC_CTL1_CTN                    BIT(1)                              /*!< continuous conversion */
#if defined(GD32F5HC)
#define ADC_CTL1_IDMA                   BIT(7)                              /*!< DMA request enable for inserted channel */
#endif /* defined(GD32F5HC) */
#define ADC_CTL1_RDMA                   BIT(8)                              /*!< DMA request enable for routine channel */
#define ADC_CTL1_RDDM                   BIT(9)                              /*!< DMA disable mode for routine channel*/
#define ADC_CTL1_EORCM                  BIT(10)                             /*!< end of conversion mode for routine channel */
#define ADC_CTL1_DAL                    BIT(11)                             /*!< data alignment */
#if defined(GD32F5HC)
#define ADC_CTL1_IDDM                   BIT(13)                             /*!< DMA disable mode for routine channel */
#endif /* defined(GD32F5HC) */
#define ADC_CTL1_ETSIC                  BITS(16, 19)                        /*!< external trigger select for inserted channel */
#define ADC_CTL1_ETMIC                  BITS(20, 21)                        /*!< external trigger enable for inserted channel */
#define ADC_CTL1_SWICST                 BIT(22)                             /*!< start on inserted channel */
#define ADC_CTL1_ETSRC                  BITS(24, 27)                        /*!< external trigger select for routine channel */
#define ADC_CTL1_ETMRC                  BITS(28, 29)                        /*!< external trigger enable for routine channel */
#define ADC_CTL1_SWRCST                 BIT(30)                             /*!< start on routine channel */

/* ADC_SAMPTx x=0..1 */
#define ADC_SAMPTX_SPTN                 BITS(0, 2)                          /*!< channel x sample time selection */

