burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_adc.h
/* ADC_IOFFx x=0..3 */
#define ADC_IOFFX_IOFF                  BITS(0, 11)                         /*!< data offset for inserted channel x */

#if defined(GD32F5HC)
/* ADC_WDHT */
#define ADC_WD0HT_WD0HT                 BITS(0, 19)                         /*!< analog watchdog 0 high threshold */
#else
/* ADC_WDHT */
#define ADC_WD0HT_WD0HT                 BITS(0, 11)                         /*!< analog watchdog 0 high threshold */
#endif /* defined(GD32F5HC) */

#if defined(GD32F5HC)
/* ADC_WD0LT */
#define ADC_WD0LT_WD0LT                 BITS(0, 19)                         /*!< analog watchdog 0 low threshold */
#else
/* ADC_WD0LT */
#define ADC_WD0LT_WD0LT                 BITS(0, 11)                         /*!< analog watchdog 0 low threshold */
#endif /* defined(GD32F5HC) */

/* ADC_RSQx */
#define ADC_RSQX_RSQN                   BITS(0, 4)                          /*!< x(x = 0..11) conversion in routine sequence */
#define ADC_RSQ0_RL                     BITS(20, 23)                        /*!< routine channel sequence length */

/* ADC_ISQ */
#define ADC_ISQ_ISQN                    BITS(0, 4)                          /*!< x conversion in inserted sequence */
#define ADC_ISQ_IL                      BITS(20, 21)                        /*!< inserted sequence length */

#if defined(GD32F5HC)
/* ADC_LDATAx x=0..3*/
#define ADC_LDATAX_LDATAN               BITS(0, 15)                         /*!< latch data channel x conversion data */
#endif /* defined(GD32F5HC) */

/* ADC_RDATA */
#define ADC_RDATA_RDATA                 BITS(0, 15)                         /*!< routine data */

#if defined(GD32F5HC)
/* ADC_IDATA*/
#define ADC_IDATA_IDATAN                BITS(0, 15)                         /*!< inserted conversion data */
#else
/* ADC_IDATAx x=0..3*/
#define ADC_IDATAX_IDATAN               BITS(0, 15)                         /*!< inserted channel x conversion data */
#endif /* defined(GD32F5HC) */

#if defined(GD32F5HC)
/* ADC_LDCTL */                                           
#define ADC_LDCTL_COVSELx               BITS(0,3)                            /*!< ADC_LDATAx register conversion source selection */
#define ADC_LDCTL_SEQSELx               BIT(7)                               /*!< ADC_LDATAx register sequence source selection */
#endif /* defined(GD32F5HC) */

/* ADC_OVSAMPCTL */
#define ADC_OVSAMPCTL_OVSEN             BIT(0)                              /*!< oversampling enable */
#define ADC_OVSAMPCTL_OVSR              BITS(2, 4)                          /*!< oversampling ratio */
#define ADC_OVSAMPCTL_OVSS              BITS(5, 8)                          /*!< oversampling shift */
#define ADC_OVSAMPCTL_TOVS              BIT(9)                              /*!< triggered oversampling */

/* ADC_CCTL */
#define ADC_CCTL_ADCCK                  BITS(16, 18)                        /*!< ADC clock */
#define ADC_CCTL_VBATEN                 BIT(22)                             /*!< channel 11 (1/4 voltate of external battery) enable of ADC */
#if defined(GD32F5HC)
#define ADC_CCTL_INREFEN                BIT(23)                             /*!< channel 10 (internal reference voltage) enable of ADC */
#define ADC_CCTL_TSVEN                  BIT(24)                             /*!< channel 9 (temperature sensor) enable of ADC */
#else
#define ADC_CCTL_TSVREN                 BIT(23)                             /*!< channel 9 (temperature sensor) and 10 (internal reference voltage) enable of ADC */
#endif /* defined(GD32F5HC) */


/* constants definitions */
/* ADC_CTL0 register value */
#define CTL0_DISNUM(regval)             (BITS(13, 15) & ((uint32_t)(regval) << 13)) /*!< number of conversions in discontinuous mode */

/* ADC special function definitions */
#define ADC_SCAN_MODE                   ADC_CTL0_SM                                 /*!< scan mode */
#define ADC_INSERTED_CHANNEL_AUTO       ADC_CTL0_ICA                                /*!< inserted sequence convert automatically */
#define ADC_CONTINUOUS_MODE             ADC_CTL1_CTN                                /*!< continuous mode */

/* temperature sensor channel, internal reference voltage channel, VBAT channel */
#define ADC_CHANNEL_INTERNAL_VBAT       ADC_CCTL_VBATEN                             /*!< VBAT channel */
#if defined(GD32F5HC)
#define ADC_CHANNEL_INTERNAL_VREFINT    ADC_CCTL_INREFEN                            /*!< vrefint channel */
#define ADC_CHANNEL_INTERNAL_TEMPSENSOR ADC_CCTL_TSVEN                              /*!< temperature sensor channel */
#else
#define ADC_CHANNEL_INTERNAL_TEMP_VREF  ADC_CCTL_TSVREN                             /*!< vrefint and temperature sensor channel */
#endif /* defined(GD32F5HC) */

/* ADC data alignment */
#define ADC_DATAALIGN_RIGHT             ((uint32_t)0x00000000U)                     /*!< LSB alignment */
#define ADC_DATAALIGN_LEFT              ADC_CTL1_DAL                                /*!< MSB alignment */

/* external trigger mode for routine and inserted  sequence */
#define EXTERNAL_TRIGGER_DISABLE        ((uint32_t)0x00000000U)                     /*!< external trigger disable */
#define EXTERNAL_TRIGGER_RISING         ((uint32_t)0x00000001U)                     /*!< rising edge of external trigger */
#define EXTERNAL_TRIGGER_FALLING        ((uint32_t)0x00000002U)                     /*!< falling edge of external trigger */
#define EXTERNAL_TRIGGER_RISING_FALLING ((uint32_t)0x00000003U)                     /*!< rising and falling edge of external trigger */

/* ADC external trigger select for routine sequence */
#define CTL1_ETSRC(regval)              (BITS(24, 27) & ((uint32_t)(regval) << 24))
#define ADC_EXTTRIG_ROUTINE_T0_CH0      CTL1_ETSRC(0)                               /*!< TIMER0 CH0 event select */
#define ADC_EXTTRIG_ROUTINE_T0_CH1      CTL1_ETSRC(1)                               /*!< TIMER0 CH1 event select */
#define ADC_EXTTRIG_ROUTINE_T0_CH2      CTL1_ETSRC(2)                               /*!< TIMER0 CH2 event select */
#define ADC_EXTTRIG_ROUTINE_T1_CH1      CTL1_ETSRC(3)                               /*!< TIMER1 CH1 event select */
#define ADC_EXTTRIG_ROUTINE_T1_CH2      CTL1_ETSRC(4)                               /*!< TIMER1 CH2 event select */
#define ADC_EXTTRIG_ROUTINE_T1_CH3      CTL1_ETSRC(5)                               /*!< TIMER1 CH3 event select */
#define ADC_EXTTRIG_ROUTINE_T1_TRGO     CTL1_ETSRC(6)                               /*!< TIMER1 TRGO event select */
#define ADC_EXTTRIG_ROUTINE_T2_CH0      CTL1_ETSRC(7)                               /*!< TIMER2 CH0 event select */
#define ADC_EXTTRIG_ROUTINE_T2_TRGO     CTL1_ETSRC(8)                               /*!< TIMER2 TRGO event select */
#define ADC_EXTTRIG_ROUTINE_T3_CH3      CTL1_ETSRC(9)                               /*!< TIMER3 CH3 event select */
#define ADC_EXTTRIG_ROUTINE_T4_CH0      CTL1_ETSRC(10)                              /*!< TIMER4 CH0 event select */
#define ADC_EXTTRIG_ROUTINE_T4_CH1      CTL1_ETSRC(11)                              /*!< TIMER4 CH1 event select */
#define ADC_EXTTRIG_ROUTINE_T4_CH2      CTL1_ETSRC(12)                              /*!< TIMER4 CH2 event select */
#define ADC_EXTTRIG_ROUTINE_EXTI_11     CTL1_ETSRC(15)                              /*!< external interrupt line 11 select  */

/* ADC external trigger select for inserted sequence */
#define CTL1_ETSIC(regval)              (BITS(16, 19) & ((uint32_t)(regval) << 16))
#define ADC_EXTTRIG_INSERTED_T0_CH3     CTL1_ETSIC(0)                               /*!< TIMER0 CH3 event select */
#define ADC_EXTTRIG_INSERTED_T0_TRGO    CTL1_ETSIC(1)                               /*!< TIMER0 TRGO event */
#define ADC_EXTTRIG_INSERTED_T1_CH0     CTL1_ETSIC(2)                               /*!< TIMER1 CH0 event select */
#define ADC_EXTTRIG_INSERTED_T1_TRGO    CTL1_ETSIC(3)                               /*!< TIMER1 TRGO event */
#define ADC_EXTTRIG_INSERTED_T2_CH1     CTL1_ETSIC(4)                               /*!< TIMER2 CH1 event select */
#define ADC_EXTTRIG_INSERTED_T2_CH3     CTL1_ETSIC(5)                               /*!< TIMER2 CH3 event select */
#define ADC_EXTTRIG_INSERTED_T3_CH0     CTL1_ETSIC(6)                               /*!< TIMER3 CH0 event select */
#define ADC_EXTTRIG_INSERTED_T3_CH1     CTL1_ETSIC(7)                               /*!< TIMER3 CH1 event select */
#define ADC_EXTTRIG_INSERTED_T3_CH2     CTL1_ETSIC(8)                               /*!< TIMER3 CH2 event select */
#define ADC_EXTTRIG_INSERTED_T3_TRGO    CTL1_ETSIC(9)                               /*!< TIMER3 TRGO event select */
#define ADC_EXTTRIG_INSERTED_T4_CH3     CTL1_ETSIC(10)                              /*!< TIMER4 CH3 event select */
#define ADC_EXTTRIG_INSERTED_T4_TRGO    CTL1_ETSIC(11)                              /*!< TIMER4 TRGO event select */
#define ADC_EXTTRIG_INSERTED_EXTI_15    CTL1_ETSIC(15)                              /*!< external interrupt line 15 */

