burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_adc.h
/* ADC status flag */
#define ADC_FLAG_WD0E                   ADC_STAT_WD0E                               /*!< analog watchdog 0 event flag */
#if defined(GD32F5HC)
#define ADC_FLAG_EORC                   ADC_STAT_EORC                               /*!< end of routine sequence conversion */
#else
#define ADC_FLAG_EOC                    ADC_STAT_EOC                                /*!< end of conversion */
#endif /* defined(GD32F5HC) */
#define ADC_FLAG_EOIC                   ADC_STAT_EOIC                               /*!< end of inserted sequence conversion */
#define ADC_FLAG_STIC                   ADC_STAT_STIC                               /*!< inserted sequence start flag */
#define ADC_FLAG_STRC                   ADC_STAT_STRC                               /*!< routine sequence start flag */
#define ADC_FLAG_ROVF                   ADC_STAT_ROVF                               /*!< routine data register overflow */
#if defined(GD32F5HC)
#define ADC_FLAG_IOVF                   ADC_STAT_IOVF                               /*!< inserted data register overflow */
#endif /* defined(GD32F5HC) */

/* ADC interrupt flag */
#define ADC_INT_WD0E                    ADC_CTL0_WD0EIE                             /*!< analog watchdog 0 event interrupt */
#if defined(GD32F5HC)
#define ADC_INT_EORC                    ADC_CTL0_EORCIE                             /*!< end of routine sequence conversion interrupt */
#else
#define ADC_INT_EOC                     ADC_CTL0_EOCIE                              /*!< end of sequence conversion interrupt */
#endif /* defined(GD32F5HC) */
#define ADC_INT_EOIC                    ADC_CTL0_EOICIE                             /*!< end of inserted sequence conversion interrupt */
#define ADC_INT_ROVF                    ADC_CTL0_ROVFIE                             /*!< routine data register overflow */
#if defined(GD32F5HC)
#define ADC_INT_IOVF                    ADC_CTL0_IOVFIE                             /*!< inserted data register overflow */
#endif /* defined(GD32F5HC) */

/* ADC interrupt flag */
#define ADC_INT_FLAG_WD0E               ADC_STAT_WD0E                               /*!< analog watchdog 0 event interrupt */
#if defined(GD32F5HC)
#define ADC_INT_FLAG_EORC               ADC_STAT_EORC                               /*!< end of routine sequence conversion interrupt */
#else
#define ADC_INT_FLAG_EOC                ADC_STAT_EOC                                /*!< end of sequence conversion interrupt */
#endif /* defined(GD32F5HC) */
#define ADC_INT_FLAG_EOIC               ADC_STAT_EOIC                               /*!< end of inserted sequence conversion interrupt */
#define ADC_INT_FLAG_ROVF               ADC_STAT_ROVF                               /*!< routine data register overflow */
#if defined(GD32F5HC)
#define ADC_INT_FLAG_IOVF               ADC_STAT_IOVF                               /*!< inserted data register overflow */
#endif /* defined(GD32F5HC) */

/* configure the ADC clock */
#define CCTL_ADCCK(regval)              (BITS(16,18) & ((uint32_t)(regval) << 16))
#define ADC_ADCCK_PCLK2_DIV2            CCTL_ADCCK(0)                               /*!< PCLK2 div2 */
#define ADC_ADCCK_PCLK2_DIV4            CCTL_ADCCK(1)                               /*!< PCLK2 div4 */
#define ADC_ADCCK_PCLK2_DIV6            CCTL_ADCCK(2)                               /*!< PCLK2 div6 */
#define ADC_ADCCK_PCLK2_DIV8            CCTL_ADCCK(3)                               /*!< PCLK2 div8 */
#define ADC_ADCCK_HCLK_DIV5             CCTL_ADCCK(4)                               /*!< HCLK div5 */
#define ADC_ADCCK_HCLK_DIV6             CCTL_ADCCK(5)                               /*!< HCLK div6 */
#define ADC_ADCCK_HCLK_DIV10            CCTL_ADCCK(6)                               /*!< HCLK div10 */
#define ADC_ADCCK_HCLK_DIV20            CCTL_ADCCK(7)                               /*!< HCLK div20 */

/* end of conversion mode */
#define ADC_EORC_SET_SEQUENCE           ((uint8_t)0x00U)                            /*!< only at the end of a sequence of routine conversions, the EORC bit is set */
#define ADC_EORC_SET_CONVERSION         ADC_CTL1_EORCM                              /*!< at the end of each routine conversion, the EORC bit is set */

/* function declarations */
/* ADC deinitialization and initialization functions */
/* reset ADC */
void adc_deinit(void);
/* configure the ADC clock */
void adc_clock_config(uint32_t prescaler);
/* enable ADC interface */
void adc_enable(void);
/* disable ADC interface */
void adc_disable(void);

/* ADC DMA functions */
/* enable DMA request */
void adc_dma_mode_enable(uint8_t adc_sequence);
/* disable DMA request */
void adc_dma_mode_disable(uint8_t adc_sequence);
/* when DMA=1, the DMA engine issues a request at end of each conversion */
void adc_dma_request_after_last_enable(uint8_t adc_sequence);
/* the DMA engine is disabled after the end of transfer signal from DMA controller is detected */
void adc_dma_request_after_last_disable(uint8_t adc_sequence);
/* configure end of conversion mode */
void adc_end_of_conversion_config(uint32_t end_selection);
/* enable or disable ADC internal channels */
void adc_internal_channel_config(uint32_t internal_channel, ControlStatus newvalue);

/* ADC special function functions */
/* configure ADC discontinuous mode */
void adc_discontinuous_mode_config(uint8_t adc_sequence, uint8_t length);
/* enable or disable ADC special function */
void adc_special_function_config(uint32_t function, ControlStatus newvalue);

/* ADC channel configuration functions */
/* configure ADC data alignment */
void adc_data_alignment_config(uint32_t data_alignment);
/* configure the length of routine sequence or inserted sequence */
void adc_channel_length_config(uint8_t adc_sequence, uint32_t length);
/* configure ADC routine channel */
void adc_routine_channel_config(uint8_t rank, uint8_t adc_channel, uint32_t sample_time);
/* configure ADC inserted channel */
void adc_inserted_channel_config(uint8_t rank, uint8_t adc_channel, uint32_t sample_time);
/* configure ADC inserted channel offset */
void adc_inserted_channel_offset_config(uint8_t inserted_channel, uint16_t offset);

/* ADC external trigger functions */
/* configure ADC external trigger */
void adc_external_trigger_config(uint8_t adc_sequence, uint32_t trigger_mode);
/* configure ADC external trigger source */
void adc_external_trigger_source_config(uint8_t adc_sequence, uint32_t external_trigger_source);
/* enable ADC software trigger */
void adc_software_trigger_enable(uint8_t adc_sequence);


/* ADC data read functions */
/* read ADC routine sequence data register */
uint16_t adc_routine_data_read(void);
#if defined(GD32F5HC)
/* read ADC inserted sequence data register */
uint16_t adc_inserted_data_read(void);
#else
/* read ADC inserted sequence data register */
uint16_t adc_inserted_data_read(uint8_t inserted_channel);
#endif /* defined(GD32F5HC) */
#if defined(GD32F5HC)
/* read ADC latch data register */
uint16_t adc_latch_data_read(uint8_t latch_data);
/* configure ADC latch data source */
void adc_latch_data_source_config(uint8_t latch_data, uint8_t adc_sequence,uint8_t rank);
#endif /* defined(GD32F5HC) */

/* ADC analog watchdog functions */
/* enable ADC analog watchdog single channel */
void adc_watchdog0_single_channel_enable(uint8_t adc_channel);
/* configure ADC analog watchdog sequence channel */
void adc_watchdog0_sequence_channel_enable(uint8_t adc_sequence);
/* disable ADC analog watchdog */
void adc_watchdog0_disable(void);
/* configure ADC analog watchdog threshold */
void adc_watchdog0_threshold_config(uint32_t low_threshold, uint32_t high_threshold);

/* ADC oversample functions */
/* configure ADC oversample mode */
void adc_oversample_mode_config(uint32_t mode, uint16_t shift, uint8_t ratio);
/* enable ADC oversample mode */
void adc_oversample_mode_enable(void);
/* disable ADC oversample mode */
void adc_oversample_mode_disable(void);

/* flag and interrupt functions */
/* get the ADC flag */
FlagStatus adc_flag_get(uint32_t flag);
/* clear the ADC flag */
void adc_flag_clear(uint32_t flag);
/* enable ADC interrupt */
void adc_interrupt_enable(uint32_t interrupt);
/* disable ADC interrupt */
void adc_interrupt_disable(uint32_t interrupt);
/* get the ADC interrupt */
FlagStatus adc_interrupt_flag_get(uint32_t int_flag);
/* clear the ADC flag */
void adc_interrupt_flag_clear(uint32_t int_flag);

#endif /* gd32w51x_f5hc_ADC_H */

